InformationRegisters/омг_ДанныеРецептовАптек.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>омг_ДанныеРецептовАптек</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.омг_СтатусыРецептов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Рецепт</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Рецепт</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.омг_НоменклатураАптеки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлючРецепта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/омг_СтатусыРецептов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>омг_СтатусыРецептов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеОтправлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеСогласован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Согласован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Неизвестен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

HTTPServices/омг_Аптеки/Ext/Module.bsl
Функция ПолучениеРасписанияПолучитьДанные(Запрос)
	
	УстановитьПривилегированныйРежим(Истина);
	Сообщение = Запрос.ПолучитьТелоКакСтроку("UTF-8");
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(Сообщение);
	ДанныеРецептаМассив = ПрочитатьJSON(ЧтениеJSON);
	ЧтениеJSON.Закрыть();
	
	Метод = Запрос.Параметрыurl.Получить("metod"); 
	Метод = ВРег(Метод);   
	МассивДанных = Новый Массив;
	
	Для каждого ДанныеРецепта из ДанныеРецептаМассив Цикл
	Если не ДанныеРецепта.Свойство("order_id") или не ДанныеРецепта.Свойство("sum") Тогда
		//Ответ = Новый HTTPСервисОтвет(400); 
	иначе 
		Ссылка = Документы.Рецепт.НайтиПоРеквизиту("омг_ключ",ДанныеРецепта.order_id); 
		РецептОбъект = Ссылка.ПолучитьОбъект();
		Если Метод = "POST" и ЗначениеЗаполнено(Ссылка) Тогда
			//"order_id": "09dc6866-8d71-11f0-a2bc-000c29c4b643",
			//    "sum": 650,
			//    "goods": [
			//        {
			//            "id": "ab47bc0a-76c8-11ed-81a3-0050560104dd",
			//            "name": "Тестовый товар",
			//            "unit": "упак",
			//            "qnt": 1,
			//            "price": 650,
			//            "sum": 650
			//        },
			//        {
			//            "id": "e7cf275a-7f80-11ed-81a3-0050560104dd",
			//            "name": "Тестовый терафлю №10 порошок",
			//            "unit": "упак",
			//            "qnt": 1,
			//            "price": 0,
			//            "sum": 0
			
			//        }
			//    ]
			//}	               
			
			
			МасНоменклатур = Новый Массив;
			ТабТовары = Новый ТаблицаЗначений;
			ТипСтрока = Новый ОписаниеТипов("Строка");
			ТипЧисло = Новый ОписаниеТипов("Число");
			ТабТовары.Колонки.Добавить("id",ТипСтрока);
			ТабТовары.Колонки.Добавить("qnt",ТипЧисло); 
			ТабТовары.Колонки.Добавить("price",ТипЧисло);
			ТабТовары.Колонки.Добавить("sum",ТипЧисло); 
			
			Для каждого строка из ДанныеРецепта.goods Цикл
				МасНоменклатур.Добавить(строка.id);	
				ЗаполнитьЗначенияСвойств(ТабТовары.Добавить(),строка);
			КонецЦикла;	
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	омг_НоменклатураАптеки.Ссылка КАК Ссылка,
			|	омг_НоменклатураАптеки.ключ КАК ключ
			|ИЗ
			|	Справочник.омг_НоменклатураАптеки КАК омг_НоменклатураАптеки
			|ГДЕ
			|	омг_НоменклатураАптеки.ключ В(&МассивНоменклатур)";
			
			Запрос.УстановитьПараметр("МассивНоменклатур", МасНоменклатур);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаНоменклатур = РезультатЗапроса.Выбрать();
			ТабТовары.Свернуть("id","qnt,price,sum");
			Набор = РегистрыСведений.омг_ДанныеРецептовАптек.СоздатьНаборЗаписей();	
			Набор.Отбор.КлючРецепта.Установить(ДанныеРецепта.order_id);
			Набор.Записать();	
			Набор = РегистрыСведений.омг_ДанныеРецептовАптек.СоздатьНаборЗаписей();	
			Набор.Отбор.КлючРецепта.Установить(ДанныеРецепта.order_id); 
			Если не РецептОбъект.омг_Статус = Перечисления.омг_СтатусыРецептов.Закрыт Тогда
				РецептОбъект.омг_Статус = Перечисления.омг_СтатусыРецептов.Закрыт;
				РецептОбъект.Записать();
			КонецЕсли;
			Период = ТекущаяДата();
			
			Для каждого строка из ТабТовары Цикл 
				ВыборкаНоменклатур.Сбросить();
				СтрПоиска = Новый Структура;
				СтрПоиска.Вставить("ключ",строка.id);    
				Если ВыборкаНоменклатур.НайтиСледующий(СтрПоиска) Тогда
					Номенклатура = ВыборкаНоменклатур.Ссылка;	
				Иначе
					Продолжить;
				КонецЕсли;
				Запись01 = Набор.Добавить();
				Запись01.Период = Период;
				Запись01.Статус = Перечисления.омг_СтатусыРецептов.Закрыт;
				Запись01.Рецепт = Ссылка;
				Запись01.Номенклатура = Номенклатура;
				Запись01.КлючРецепта = ДанныеРецепта.order_id;	
				Запись01.Количество = строка.qnt;
				Запись01.Цена = строка.price;
				Запись01.Сумма = строка.sum;
			КонецЦикла;	 
			Набор.Записать();  
			МассивДанных.Добавить(ДанныеРецепта.order_id);
			//Ответ = Новый HTTPСервисОтвет(200);
			//Ответ.УстановитьТелоИзСтроки(
		иначе
			//Ответ = Новый HTTPСервисОтвет(400); 	
		КонецЕсли; 
		
	КонецЕсли; 
КонецЦикла;      

    ЗаписьJSON = Новый ЗаписьJSON();
    ЗаписьJSON.УстановитьСтроку(); 
	
	ЗаписатьJSON(ЗаписьJSON, МассивДанных);
    СтрокаJSON = ЗаписьJSON.Закрыть();     
    Ответ = Новый HTTPСервисОтвет(200); 
    
    Ответ.Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");
    
    Ответ.УстановитьТелоИзСтроки(СтрокаJSON);
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Ответ;
	
КонецФункции
